БухЭксп/Catalogs/CW_Оборудование.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_Оборудование</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидПеревозки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_ВидыПеревозок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Типоразмер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ТипоразмерыКонтейнеров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПараметрыГрузоперевозки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Параметр</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.CW_ПараметрыГрузоперевозок</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.CW_ПараметрыГрузоперевозок</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Примечание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХранилищеДанных</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/Enums/CW_ВидыПеревозок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>CW_ВидыПеревозок</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Контейнер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

БухЭксп/Catalogs/CW_ОтслеживаемоеОборудование.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_ОтслеживаемоеОборудование</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Оборудование</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_Оборудование</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантСлежения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ВариантыСлежения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоСлежения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкончаниеСлежения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПараметрыГрузоперевозки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Параметр</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.CW_ПараметрыГрузоперевозок</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.CW_ПараметрыГрузоперевозок</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Примечание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХранилищеДанных</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДобавлятьВКарточку</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/Catalogs/CW_Грузоперевозки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_Грузоперевозки</Name>
			<Comment>Грузоперевозки</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
			<BasedOn>
				<xr:Item>Catalog.CW_Заявки</xr:Item>
			</BasedOn>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаСделкиФ</Name>
					<Comment>Дата сделки (фактическая)</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Comment>Клиент</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Комментарий</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МенеджерПродаж</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОперативныйМенеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Груз</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_Грузы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Маршрут</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_МаршрутыГрузоперевозок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПеревозки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ТипыПеревозок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Типоразмер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ТипоразмерыКонтейнеров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CW_Представление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_Заказы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СодержитДинамическиеПараметры</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Архив</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Незаполнена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заявка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_Заявки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтслеживаемоеОборудование</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ОтслеживаемоеОборудование</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПривязкиОборудования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтключитьСлежение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомментарийБюджета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Перекодирована</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Коносамент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_Коносаменты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПараметрыГрузоперевозки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Параметр</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.CW_ПараметрыГрузоперевозок</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.CW_ПараметрыГрузоперевозок</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Примечание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеПлан</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеФакт</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХранилищеДанных</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторВладельца</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КонтрагентыПоБюджету</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.CW_Контрагенты</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ГруппыПараметровГрузоперевозки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Идентификатор</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторВедущего</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторыВедомых</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Раскрывать</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторГруппы</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторВладельца</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Порядок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/Catalogs/CW_Оборудование/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтаФорма.ТолькоПросмотр = (НЕ CW_ПраваДоступа.ПравоДоступно("РедактированиеОбъектовСлежения"));
	ПравоРедактирования = CW_ПраваДоступа.ПравоДоступно("РедактированиеОбъектовСлежения");   
	
	КонтролироватьКоректностьНомераКонтейнерногоОборудования = ПолучитьФункциональнуюОпцию("CW_КонтролироватьКоректностьНомераКонтейнерногоОборудования");

	Элементы.ОтслеживаемоеОборудование.ИзменятьПорядокСтрок = ПравоРедактирования;
	Элементы.ОтслеживаемоеОборудование.ИзменятьСоставСтрок = ПравоРедактирования;
	Элементы.ОтслеживаемоеОборудование.ТолькоПросмотр = (НЕ ПравоРедактирования);
	
	// кэшируем свойства параметров
	ОбновитьСвойстваПараметров();
	_ОбновитьУсловноеОформлениеПараметров();
	УправлениеЭлементамиФормы();
	ИнициализацияСписков();
	
	ПроверитьНомерКонтейнера();  
	
	//Внешние подклчюаемые команды
	CW_ПодключаемыеКомандыСервер.ПриСозданииНаСервере(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	//ХранениеПолногоЗначения
	Для Каждого СтрокаОбъекта из ТекущийОбъект.ПараметрыГрузоперевозки Цикл
		ДобавитьСохраняемоеПолноеЗначение(СтрокаОбъекта.Параметр, СтрокаОбъекта.ХранилищеДанных.Получить());
	КонецЦикла;
	//---ХранениеПолногоЗначения

КонецПроцедуры 

&НаКлиенте
Процедура ПараметрыГрузоперевозкиПередУдалением(Элемент, Отказ)
	
	ТекущиеДанные = Элементы.ПараметрыГрузоперевозки.ТекущиеДанные;
	УдалитьСохраняемоеПолноеЗначение(ТекущиеДанные.Параметр);
	
КонецПроцедуры 

&НаСервере
Процедура ОбновитьСвойстваПараметров()
	
	КартаПравПараметров 		= CW_ПраваДоступа.НаборПравДляПараметров();
	АдресКартыПравПараметров 	= ПоместитьВоВременноеХранилище(КартаПравПараметров, ЭтаФорма.УникальныйИдентификатор);

	КартаСвойствПараметров 		= _БЭ.ПолучитьСоответствиеСвойствПараметров();
	АдресКартыСвойствПараметров = ПоместитьВоВременноеХранилище(КартаСвойствПараметров, ЭтаФорма.УникальныйИдентификатор);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи) 
	
	Если Объект.ВидПеревозки = Перечисления.CW_ВидыПеревозок.Контейнер  
		И КонтролироватьКоректностьНомераКонтейнерногоОборудования 
		И НЕ _БЭ.НомерКонтейнераКорректный(Объект.Наименование) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Введен некорректный номер контейнера!",, "Наименование","Объект", Отказ);
	КонецЕсли;  
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	//Запись данных харнилища занчений по строкам 
	Для Каждого ЭлементСписка из СписокАдресовЗначенийПараметров Цикл
		
		//ДанныеПоАдресу - тип "Структура("Параметр, ТаблицаДанных")
		ДанныеПоАдресу = ЭлементСписка.Значение;
		
		Отбор = Новый Структура("Параметр", ДанныеПоАдресу.Параметр);
		мСтроки = ТекущийОбъект.ПараметрыГрузоперевозки.НайтиСтроки(Отбор);
		Если мСтроки.Количество() > 0 Тогда
			//Предполагаем что строка будет только одна
			СтрокаДанных = мСтроки[0]; 
			СтрокаДанных.ХранилищеДанных = новый ХранилищеЗначения(ДанныеПоАдресу.ДанныеДляХранения);	
		КонецЕсли;
		
	КонецЦикла;

	//ХранениеПолногоЗначения 
	Если ТипЗнч(СохраняемоеПолноеЗначение) = Тип("ФиксированноеСоответствие") Тогда 
		Для Каждого КлючЗначение из СохраняемоеПолноеЗначение Цикл
			Отбор = Новый Структура("Параметр", КлючЗначение.Ключ);
			НайденныеСтроки = ТекущийОбъект.ПараметрыГрузоперевозки.НайтиСтроки(Отбор);
			Если НайденныеСтроки.Количество() > 0 Тогда
				//Предполагаем что строка будет только одна
				СтрокаДанных = НайденныеСтроки[0];   
				СтрокаДанных.ХранилищеДанных = новый ХранилищеЗначения(КлючЗначение.Значение);
			КонецЕсли;
		КонецЦикла; 
	КонецЕсли;
	//---ХранениеПолногоЗначения
	
КонецПроцедуры  



&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	УправлениеЭлементамиФормы();
	ИнициализацияСписков();
	
КонецПроцедуры


&НаСервере
Процедура ИнициализацияСписков()
	
	ОтслеживаемоеОборудование.Параметры.УстановитьЗначениеПараметра("Оборудование", Объект.Ссылка);
	_УФС.ДобавитьОтбор(ОтслеживаемоеОборудование.Отбор,"Оборудование",,Объект.Ссылка);
	
	Элементы.ОтслеживаемоеОборудование.Обновить();
	
	Грузоперевозки.Параметры.УстановитьЗначениеПараметра("ОтслеживаемоеОборудование",Объект.Ссылка);
	Грузоперевозки.Параметры.УстановитьЗначениеПараметра("ПустоеОтслеживаемоеОборудование",Справочники.CW_ОтслеживаемоеОборудование.ПустаяСсылка());
	Элементы.Грузоперевозки.Обновить();

	Статусы.Параметры.УстановитьЗначениеПараметра("Оборудование",Объект.Ссылка);
	Элементы.Статусы.Обновить();
	
КонецПроцедуры

&НаСервере
Процедура УправлениеЭлементамиФормы()
	
	Элементы.Типоразмер.Видимость = (Объект.ВидПеревозки=Перечисления.CW_ВидыПеревозок.Контейнер);
	
	Элементы.СтраницаОбъекты.Видимость = (НЕ Объект.Ссылка.Пустая());
	Элементы.СтраницаСтатусы.Видимость = (НЕ Объект.Ссылка.Пустая());
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьНомерКонтейнера()
	
	Если НЕ КонтролироватьКоректностьНомераКонтейнерногоОборудования Тогда
		Возврат;
	КонецЕсли;
	
	ЦветТекста = Новый Цвет; 
	Если Объект.ВидПеревозки = Перечисления.CW_ВидыПеревозок.Контейнер 
		И НЕ _БЭ.НомерКонтейнераКорректный(Объект.Наименование) Тогда
		ЦветТекста = ЦветаСтиля.ЦветОсобогоТекста;	
	КонецЕсли;  
	
	Элементы.Наименование.ЦветТекста = ЦветТекста;
	
КонецПроцедуры


&НаКлиенте
Процедура ВидПеревозкиПриИзменении(Элемент) 
	
	ПроверитьНомерКонтейнера();	
	УправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура СтатусыСрезПоследних(Команда)
	СтатусыСрезПоследнихНаСервере();
КонецПроцедуры

&НаСервере
Процедура СтатусыСрезПоследнихНаСервере()
	
	ПоказатьТекущийСтатус = НЕ ПоказатьТекущийСтатус;
	Элементы.СтатусыСтатусыСрезПоследних.Пометка = ПоказатьТекущийСтатус;
	
	Статусы.Отбор.Элементы.Очистить();
	
	ЭлементОтбора = Статусы.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("ТекущийСтатус");
	ЭлементОтбора.ВидСравнения 		= ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение 	= Истина;
	ЭлементОтбора.Использование 	= ПоказатьТекущийСтатус;
	
КонецПроцедуры


#Область ДобавлениеПараметров 

&НаКлиенте
Процедура ПараметрыГрузоперевозкиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	// --- 
	ПОВ = Новый ОписаниеОповещения("ОбработкаВыбораПараметра",ЭтотОбъект); 
	
	ПарамерыФормыВыбора = Новый Структура;
	ПарамерыФормыВыбора.Вставить("ВыборГруппИЭлементов"	, ИспользованиеГруппИЭлементов.ГруппыИЭлементы);
	ПарамерыФормыВыбора.Вставить("Множественныйвыбор"	, Истина);
	ПарамерыФормыВыбора.Вставить("Отбор"				, Новый Структура("ЭтоКонтрольнаяДата,ДинамическийПараметр",Ложь,Ложь));
	
	ОткрытьФорму("ПланВидовХарактеристик.CW_ПараметрыГрузоперевозок.ФормаВыбора",ПарамерыФормыВыбора,Элемент,,,,ПОВ, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораПараметра(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ <> Неопределено Тогда
		Модифицированность = истина;
		
		Если ТипЗнч(Ответ) = Тип("ПланВидовХарактеристикСсылка.CW_ПараметрыГрузоперевозок") Тогда
			Ответ = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Ответ);
		КонецЕсли;
		
		Для каждого Параметр из Ответ Цикл
			Если _ПараметрЯвляетсяГруппой(Параметр) Тогда
				
				МассивДобавляемых = _ЭлементыГруппыПараметров(Параметр);
				Для каждого Добавляемыйпараметр из МассивДобавляемых Цикл
					// проверяем, что параметр новый
					Если (ДобавляемыйПараметрНовый(ДобавляемыйПараметр)) Тогда
						ИдентификаторДобавленнойСтроки = _ДобавитьПараметр(ДобавляемыйПараметр);
					КонецЕсли;
				КонецЦикла;
			Иначе
				// проверяем, что параметр новый
				Если (ДобавляемыйПараметрНовый(Параметр)) Тогда
					ИдентификаторДобавленнойСтроки = _ДобавитьПараметр(Параметр);
				КонецЕсли;				
			КонецЕсли; 	
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция _ПараметрЯвляетсяГруппой(Параметр)
	// --- 
	
	Возврат(Параметр.ЭтоГруппа);
	
	// --- 
КонецФункции

&НаСервере
Функция _ЭлементыГруппыПараметров(ГруппаПараметров)
	// --- 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ПараметрыГрузоперевозок.Ссылка
	               |ИЗ
	               |	ПланВидовХарактеристик.CW_ПараметрыГрузоперевозок КАК CW_ПараметрыГрузоперевозок
	               |ГДЕ
	               |	CW_ПараметрыГрузоперевозок.Ссылка В ИЕРАРХИИ(&Ссылка)
	               |	И CW_ПараметрыГрузоперевозок.ЭтоГруппа = ЛОЖЬ
	               |	И CW_ПараметрыГрузоперевозок.ПометкаУдаления = ЛОЖЬ";
	Запрос.УстановитьПараметр("Ссылка", ГруппаПараметров);
	ТЗ = Запрос.Выполнить().Выгрузить();
	Возврат(ТЗ.ВыгрузитьКолонку("Ссылка"));
	
	// --- 
КонецФункции

&НаКлиенте
Функция ДобавляемыйПараметрНовый(Параметр)
	// --- 
	
	Отбор = Новый Структура("Параметр",Параметр);
	СтрокиПараметра = Объект.ПараметрыГрузоперевозки.НайтиСтроки(Отбор);
	Возврат(СтрокиПараметра.Количество()=0);
	
	// --- 
КонецФункции

&НаСервере
Функция _ДобавитьПараметр(Параметр)
	
	// добавляем в ТЧ параметров
	СтрокаПараметра = Объект.ПараметрыГрузоперевозки.Добавить();
	СтрокаПараметра.Параметр = Параметр;

	//ХранениеПолногоЗначения
	ДобавитьСохраняемоеПолноеЗначение(СтрокаПараметра.Параметр);
	//---ХранениеПолногоЗначения

	_ОбновитьУсловноеОформлениеПараметров();

	Возврат Неопределено;
	
КонецФункции

#КонецОбласти 


#Область РедактированиеПараметров 

&НаКлиенте
Процедура ПараметрыГрузоперевозкиПередНачаломИзменения(Элемент, Отказ)
	
	Отказ = Истина;
	Идентификатор = Элементы.ПараметрыГрузоперевозки.ТекущаяСтрока;
	СтрокаТЧ = Объект.ПараметрыГрузоперевозки.НайтиПоИдентификатору(Идентификатор);
	// ---------------------------------------------------------------------------- 
	
	Параметр = Элемент.ТекущиеДанные.Параметр;
	
	// --- 
	ПараметрТолькоПросмотр = _ТолькоПросмотр(Параметр);
	СвойстваПараметра = _БЭ.СтруктураСвойствПараметра(Параметр);	
	Если (СвойстваПараметра.Ведомый) Тогда
		
		// проверяем ведущие на заполненность
		Результат = _ПроверитьЗаполнениеВедущих(Параметр,СвойстваПараметра.СписокВедущих);
		Если (НЕ _УФКС.ВыполненоУспешно(Результат)) Тогда
			
			_УФК.ВывестиПредупреждение("Данный параметр является зависимым!");
			Возврат;
			
		КонецЕсли;
		
	КонецЕсли; 
	Если (СвойстваПараметра.ДинамическийПараметр) Тогда
		
		_УФК.ВывестиПредупреждение("Динамические параметры не редактируются");
		Возврат;
		
	КонецЕсли;
	// --- 
	
	АдресОбъекта 	= _АдресОбъекта();
	ВыбраннаяФорма 	= Неопределено;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Режим"					, "РедактированиеОбъекта");
	ПараметрыФормы.Вставить("Параметр"				, Параметр);
	ПараметрыФормы.Вставить("АдресСвойствПараметра"	, ПоместитьВоВременноеХранилище(СвойстваПараметра,ЭтаФорма.УникальныйИдентификатор));
	ПараметрыФормы.Вставить("АдресОбъекта"			, АдресОбъекта);
	ПараметрыФормы.Вставить("ТолькоПросмотр"		, ПараметрТолькоПросмотр);
	ПараметрыФормы.Вставить("Значение"			    , СтрокаТЧ.Значение);
	
	//ХранениеПолногоЗначения  
	Если CW_МониторинговыеПараметрыСервер.ИспользуетсяСохранениеПолногоЗначения(Параметр) Тогда
		Если ТипЗнч(СохраняемоеПолноеЗначение) = Тип("ФиксированноеСоответствие") Тогда
			ПолноеЗначение = СохраняемоеПолноеЗначение.Получить(Параметр);
		КонецЕсли;
		ПолноеЗначение = ?(ПолноеЗначение=Неопределено, СтрокаТЧ.Значение, ПолноеЗначение);
		
		ПараметрыФормы.Вставить("ПолноеЗначение", ПолноеЗначение);
	КонецЕсли;
	//---ХранениеПолногоЗначения

	ПОВ = Новый ОписаниеОповещения("ОбработатьИзменениеПараметра",ЭтотОбъект,Новый Структура("СвойстваПараметра,Параметр",СвойстваПараметра,Параметр));
	Если СвойстваПараметра.ИспользоватьФормуВыбораОбъекта тогда
		Если Не ПараметрТолькоПросмотр Тогда
			ВыбраннаяФорма = СвойстваПараметра.ИмяФормыВыбора;
			
			ПараметрыФормы.Вставить("РежимВыбора"		,         Истина);
			ПараметрыФормы.Вставить("ЗакрыватьПриВыборе",         Истина);
			
			Если СвойстваПараметра.ИспользуютсяДополнительныеЗначения Тогда
				ПараметрыФормы.Вставить("Отбор", Новый Структура("Владелец",Параметр));
			КонецЕсли;
			
		КонецЕсли;
	Иначе
		Если СвойстваПараметра.ИспользуетсяВнешняяОбработкаПередНачаломИзменения Тогда
			СтруктураПараметров = _ПО.ПолучитьИмяФормыНаСервере(Параметр, АдресОбъекта);
			ВыбраннаяФорма 		= "ПланВидовХарактеристик.CW_ПараметрыГрузоперевозок.Форма.ФормаРедактирования";
			
			ОбработчикНеИспользуется = Ложь;
			Если СтруктураПараметров.Свойство("НеИспользуется") Тогда
				ОбработчикНеИспользуется = СтруктураПараметров.НеИспользуется;
			КонецЕсли;
			
			Если СтруктураПараметров.Свойство("ТолькоПросмотр") Тогда
				Если  НЕ ПараметрыФормы.ТолькоПросмотр Тогда
					ПараметрыФормы.ТолькоПросмотр =  СтруктураПараметров.ТолькоПросмотр;
				КонецЕсли;
			КонецЕсли;
			
			Если СтруктураПараметров.Свойство("ПодключаемыйОбъект") Тогда
				ПараметрыФормы.Вставить("ПодключаемыйОбъект",СтруктураПараметров.ПодключаемыйОбъект);
			КонецЕсли; 	
				
			Если ОбработчикНеИспользуется ИЛИ 
				СтруктураПараметров.РежимОткрытия = 1 Тогда
				ВыбраннаяФорма = "ПланВидовХарактеристик.CW_ПараметрыГрузоперевозок.Форма.ФормаРедактирования";
			ИначеЕсли	СтруктураПараметров.РежимОткрытия = 0 Тогда
				ВыбраннаяФорма = СтруктураПараметров.ИмяФормы;
			КонецЕсли;

		Иначе
			ВыбраннаяФорма = "ПланВидовХарактеристик.CW_ПараметрыГрузоперевозок.Форма.ФормаРедактирования";
		КонецЕсли;
		
	КонецЕсли;
	
	Если ВыбраннаяФорма <> Неопределено Тогда
		ОткрытьФорму(ВыбраннаяФорма, ПараметрыФормы,ЭтаФорма,,,,ПОВ,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
	
	
КонецПроцедуры

&НаСервере
Функция _АдресОбъекта()

	ТаблицаПараметров = Объект.ПараметрыГрузоперевозки.Выгрузить();
	ТаблицаПараметров.Колонки.Добавить("ХранилищеДанных"); 
	ТаблицаПараметров.Очистить(); 
	
	ТОбъект = РеквизитФормыВЗначение("Объект");
	Для Каждого СтрокаТаблицы из ТОбъект.ПараметрыГрузоперевозки Цикл
		НоваяСтрока = ТаблицаПараметров.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы); 
		
		НоваяСтрока.ХранилищеДанных = Новый ХранилищеЗначения(СтрокаТаблицы.ХранилищеДанных.Получить());
	КонецЦикла;
	
	СтруктураОбъекта = Новый Структура;
	СтруктураОбъекта.Вставить("Ссылка",	 			Объект.Ссылка);
	СтруктураОбъекта.Вставить("ТаблицаПараметров", 	ТаблицаПараметров);
	
	Возврат ПоместитьВоВременноеХранилище(СтруктураОбъекта,ЭтаФорма.УникальныйИдентификатор);
	

КонецФункции

&НаСервере
Функция _ТолькоПросмотр(Параметр)
	// --- 
	
	ТолькоПросмотр = Истина;
	
	НаборПрав = ПолучитьИзВременногоХранилища(АдресКартыПравПараметров);
	Попытка
		
		ТолькоПросмотр = (НЕ НаборПрав["п_"+_сф.КлючПоСсылке(Параметр)].Редактирование);
		
	Исключение
		ТолькоПросмотр = Истина;
	КонецПопытки; 
	
	Возврат(ТолькоПросмотр);
	
	// --- 
КонецФункции

&НаСервере
Функция _ПроверитьЗаполнениеВедущих(Параметр,СписокВедущих)
	// --- 
	
	// контроллируем заполнение и единство
	ФлагОшибки = Ложь;
	ТекстОшибки = "";
	Для каждого ВедущийПГ Из СписокВедущих Цикл
		
		// проверяем параметр у переданных объектов
		МассивНепустыхЗначений = Новый Массив;
		
		ВедущийПараметр = ВедущийПГ.Значение;
		СтрокаПараметра = _сф.к_НайтиСтроку(Объект.ПараметрыГрузоперевозки,"Параметр",ВедущийПараметр);
		Если СтрокаПараметра = Неопределено Тогда
			
			ЗначениеПараметра = Неопределено;
			
		Иначе
			
			ЗначениеПараметра = СтрокаПараметра.Значение;
			
		КонецЕсли; 
		Если ЗначениеЗаполнено(ЗначениеПараметра) Тогда
			
			_сф.м_ДобавитьУникально(МассивНепустыхЗначений,ЗначениеПараметра);
			
		Иначе
			
			ФлагОшибки = Истина;
			ТекстОшибки = "";
			
		КонецЕсли; 
		
		
		// теперь если нет ошибки считаем количество
		// если не 1, то выдаём ошибку
		Если НЕ ФлагОшибки Тогда
			
			Если МассивНепустыхЗначений.Количество() <> 1 Тогда
				
				ФлагОшибки = Истина;
				ТекстОшибки = ""
				
			КонецЕсли; 
			
		КонецЕсли; 
		
		Если ФлагОшибки Тогда
			
			// тут необходимо закрыть форму и вернуть описание ошибки
			ТекстОшибки = "Условия отбора для выбранного параметра ("""+Параметр.Наименование+""") требуют, чтобы было задано значение параметра """+ВедущийПараметр.Наименование+""".";
			Возврат(_УФКС.Ответ(1,ТекстОшибки));
			
		КонецЕсли; 
		
	КонецЦикла; 
	
	Возврат(_УФКС.Ответ());
	
	// --- 
КонецФункции

// --- 

&НаКлиенте
Процедура ОбработатьИзменениеПараметра(Ответ,ДополнительныеПараметры) Экспорт 
	// --- 
	
	Если (Ответ <> Неопределено) Тогда
		
		Если ТипЗнч(Ответ) <> Тип("Структура") И ТипЗнч(Ответ) <> Тип("Массив") Тогда
			//В случае если ответ форме не имеет тип структура, поместим его в структуру для последующей обработки
			Ответ = _ПО.ПолучитьСтруктуруОтветаВнешнейФормы(Ответ, ДополнительныеПараметры.Параметр);
		КонецЕсли;
		
		Если ТипЗнч(Ответ) <> Тип("Массив") Тогда
			МассивПараметров = Новый Массив;
			МассивПараметров.Добавить(Ответ);
		Иначе
			МассивПараметров = Ответ;
		КонецЕсли;
		
		Для каждого ОтветСтруктура из МассивПараметров Цикл
			
			Если (ОтветСтруктура.ПараметрИзменен) Тогда
				
				Если (ДополнительныеПараметры.СвойстваПараметра = Неопределено) Тогда
					СписокВедомых = Неопределено;
				Иначе	
					СписокВедомых = ДополнительныеПараметры.СвойстваПараметра.СписокВедомых;
				КонецЕсли; 
				// --- 
				Ответ = _ОбновитьПараметр(ОтветСтруктура, СписокВедомых);	
				Если (_УФКС.ВыполненоУспешно(Ответ)) Тогда
					
					ЭтаФорма.Модифицированность = Истина;
					
				КонецЕсли; 
				
			КонецЕсли; 
			
		КонецЦикла;
		
	КонецЕсли;
	
	// --- 
КонецПроцедуры

&НаСервере
Функция _ОбновитьПараметр(СтруктураПараметра, СписокВедомых)
	// --- 
	
	Параметр = СтруктураПараметра.Параметр;
	// --- 
	КартаСвойств = ПолучитьИзВременногоХранилища(АдресКартыСвойствПараметров);
	СП = КартаСвойств.Получить(Параметр);
	КартаПрав = ПолучитьИзВременногоХранилища(АдресКартыПравПараметров);
	НП = КартаПрав["п_"+_сф.КлючПоСсылке(Параметр)];
	// --- 
	СтрокаПараметра = _сф.к_НайтиСтроку(Объект.ПараметрыГрузоперевозки,Новый Структура("Параметр",Параметр));
	Если (СтруктураПараметра.Значение <> Неопределено) Тогда
		СтрокаПараметра.Значение = СтруктураПараметра.Значение;
	КонецЕсли; 
	Если (СП.ЭтоКонтрольнаяДата) Тогда
		Если (СтрокаПараметра.ЗначениеПлан <> Неопределено) Тогда
			СтрокаПараметра.ЗначениеПлан = СтруктураПараметра.ЗначениеПлан;
		КонецЕсли;
		Если (СтрокаПараметра.ЗначениеФакт <> Неопределено) Тогда
			СтрокаПараметра.ЗначениеФакт = СтруктураПараметра.ЗначениеФакт;
		КонецЕсли;
	КонецЕсли; 
	Если (СтрокаПараметра.Примечание <> Неопределено) Тогда
		СтрокаПараметра.Примечание = СтруктураПараметра.Примечание;
	КонецЕсли;

	//ХранениеПолногоЗначения   
	Если CW_МониторинговыеПараметрыСервер.ИспользуетсяСохранениеПолногоЗначения(Параметр) Тогда 
		ДобавитьСохраняемоеПолноеЗначение(Параметр, СтруктураПараметра.ПолноеЗначение); 
	КонецЕсли;
	//---ХранениеПолногоЗначения
	
	Ответ = _УФКС.Ответ();
	Возврат(Ответ);
	
	// --- 
КонецФункции

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	
	ПроверитьНомерКонтейнера();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтслеживаемоеОборудованиеПриАктивизацииСтроки(Элемент)
	
	Если (Элементы.ОтслеживаемоеОборудование.ТекущаяСтрока <> Неопределено) Тогда
		
	КонецЕсли; 
	ПодключитьОбработчикОжидания("ПоказатьГрузоперевозкиОтслеживаемогоОборудования",0.1,Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьГрузоперевозкиОтслеживаемогоОборудования() Экспорт 
	// --- 
	
	_УстановитьОтборГрузоперевозок(Элементы.ОтслеживаемоеОборудование.ТекущаяСтрока);
	
	// --- 
КонецПроцедуры

&НаСервере
Процедура _УстановитьОтборГрузоперевозок(ОтслеживаемоеОборудование)
	// --- 
	
	Грузоперевозки.Параметры.УстановитьЗначениеПараметра("ОтслеживаемоеОборудование",ОтслеживаемоеОборудование);
	Грузоперевозки.Параметры.УстановитьЗначениеПараметра("ПустоеОтслеживаемоеОборудование",Справочники.CW_ОтслеживаемоеОборудование.ПустаяСсылка());
	Элементы.Грузоперевозки.Обновить();	
	
	// --- 
КонецПроцедуры

#КонецОбласти 


&НаКлиенте
Процедура КомандаПерезаполнитьПараметрыВедомых(Команда)
	
	ПОВ = Новый ОписаниеОповещения("ОбработкаПодтвержденияПерезаписиПараметров",ЭтотОбъект, Новый Структура()); 
	ПоказатьВопрос(ПОВ,"Прописать параметры в отслеживаемое оборудование и в связанные грузоперевозки?",РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры
 
&НаКлиенте
Процедура ОбработкаПодтвержденияПерезаписиПараметров(Ответ, ДополнительныеПараметры) Экспорт 
	// --- 
	
	Если (Ответ <> Неопределено) Тогда
		
		Если (Ответ = КодВозвратаДиалога.Да) Тогда
			
			Записать();
			_ПерезаполнитьПараметрыВедомых();
			
		КонецЕсли;  
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры
  
&НаСервере
Процедура _ПерезаполнитьПараметрыВедомых()
	// --- 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	CW_ОтслеживаемоеОборудование.Ссылка
	|ИЗ
	|	Справочник.CW_ОтслеживаемоеОборудование КАК CW_ОтслеживаемоеОборудование
	|ГДЕ
	|	CW_ОтслеживаемоеОборудование.Оборудование = &Оборудование";
	Запрос.УстановитьПараметр("Оборудование", Объект.Ссылка);
	ТЗ = Запрос.Выполнить().Выгрузить();
	// --- 
	Для каждого Стр Из ТЗ Цикл
		
		ОтслеживаемоеОборудованиеОбъект = Стр.Ссылка.ПолучитьОбъект();
		// --- 
		Для каждого СтрокаПараметраОборудования Из Объект.ПараметрыГрузоперевозки Цикл
			
			СтрокаПараметра = CW_Мониторинг.СтрокаПараметра(ОтслеживаемоеОборудованиеОбъект,СтрокаПараметраОборудования.Параметр);
			Если (СтрокаПараметра = Неопределено) Тогда
				
				СтрокаПараметра = ОтслеживаемоеОборудованиеОбъект.ПараметрыГрузоперевозки.Добавить();
				СтрокаПараметра.Параметр = СтрокаПараметраОборудования.Параметр;
				
			КонецЕсли; 
			СтрокаПараметра.Значение = СтрокаПараметраОборудования.Значение;
			
		КонецЦикла; 
		// --- 
		ОтслеживаемоеОборудованиеОбъект.Записать();
		
	КонецЦикла;
	
	// --- 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_Грузоперевозки.Ссылка
	               |ИЗ
	               |	Справочник.CW_Грузоперевозки КАК CW_Грузоперевозки
	               |ГДЕ
	               |	CW_Грузоперевозки.ОтслеживаемоеОборудование.Оборудование = &Оборудование";
	Запрос.УстановитьПараметр("Оборудование", Объект.Ссылка);
	ТЗ = Запрос.Выполнить().Выгрузить();
	// --- 
	Для каждого Стр Из ТЗ Цикл
		
		ГрузоперевозкаОбъект = Стр.Ссылка.ПолучитьОбъект();
		// --- 
		Для каждого СтрокаПараметраОборудования Из Объект.ПараметрыГрузоперевозки Цикл
			
			СтрокаПараметра = CW_Мониторинг.СтрокаПараметра(ГрузоперевозкаОбъект,СтрокаПараметраОборудования.Параметр);
			Если (СтрокаПараметра = Неопределено) Тогда
				
				СтрокаПараметра = ГрузоперевозкаОбъект.ПараметрыГрузоперевозки.Добавить();
				СтрокаПараметра.Параметр = СтрокаПараметраОборудования.Параметр;
				
			КонецЕсли; 
			СтрокаПараметра.Значение = СтрокаПараметраОборудования.Значение;
			
		КонецЦикла; 
		// --- 
		ГрузоперевозкаОбъект.Записать();
		
	КонецЦикла;
	 
	
	
	// --- 
КонецПроцедуры
 
&НаСервере
Процедура _ОбновитьУсловноеОформлениеПараметров()
	// --- 
	
	СвойстваПараметров = ПолучитьИзВременногоХранилища(АдресКартыСвойствПараметров);
	// --- 
	
	ЭтаФорма.УсловноеОформление.Элементы.Очистить();
	Для каждого Стр Из Объект.ПараметрыГрузоперевозки Цикл
		
		ФорматВывода = Стр.Параметр.ФорматВывода;
		Если (ФорматВывода = "") Тогда
			
			СвойстваПараметра = СвойстваПараметров.Получить(Стр.Параметр);
			Если (СвойстваПараметра = Неопределено) Тогда
				КартаСвойств = ПолучитьИзВременногоХранилища(АдресКартыСвойствПараметров);
				СвойстваПараметра = КартаСвойств.Получить(Стр.Параметр);
			КонецЕсли;
			ТипЗначенияПараметра = СвойстваПараметра.ТипЗначения;
			ТипПараметра = СвойстваПараметра.ТипЗначения.Типы()[0];
			Если (СвойстваПараметра.ЭтоКонтрольнаяДата) Тогда
				
				Если (НЕ СвойстваПараметра.КонтрольнаяДатаИспользуетВремя) Тогда
					ФорматВывода = "ДФ=dd.MM.yyyy";
				Иначе
					ФорматВывода = "ДФ='dd.MM.yyyy HH:mm'";
				КонецЕсли; 
				
			Иначе
				
				Если (ТипПараметра = Тип("Булево") ИЛИ ТипПараметра = Тип("Дата") ИЛИ ТипПараметра=Тип("Число")) Тогда
					
					Если ТипПараметра = Тип("Дата") Тогда
						
						ФорматВывода = "";
						ЧастьДаты = ТипЗначенияПараметра.КвалификаторыДаты.ЧастиДаты;
						Если ЧастьДаты = ЧастиДаты.Дата Тогда
							
							// формат дат по умолчанию
							ФорматВывода = "ДФ=dd.MM.yyyy";
							
						ИначеЕсли ЧастьДаты = ЧастиДаты.Время Тогда 
							
							// формат дат по умолчанию
							ФорматВывода = "ДФ=HH:mm:ss";
							
						ИначеЕсли ЧастьДаты = ЧастиДаты.ДатаВремя Тогда 
							
							// формат дат по умолчанию
							ФорматВывода = "ДЛФ=";
							
						КонецЕсли;
						
					КонецЕсли; 
					
				КонецЕсли; 					
				
			КонецЕсли;  
		КонецЕсли; 
		Если (ФорматВывода <> "") Тогда
			УО = _УФС.ДобавитьПростоеУсловноеОформление(ЭтаФорма,"Объект.ПараметрыГрузоперевозки.Параметр",,Стр.Параметр,"ПараметрыГрузоперевозкиЗначение","Формат",ФорматВывода);
		КонецЕсли; 
		
	КонецЦикла; 
	
	// --- 
КонецПроцедуры


&НаКлиенте
Процедура КомандаОбновитьПараметры(Команда)
	
	_ОбновитьУсловноеОформлениеПараметров();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если (ИмяСобытия = "ПараметрИзменен") Тогда
		
		ОбновитьСвойстваПараметров();
		
	КонецЕсли;
	
КонецПроцедуры


//ХранениеПолногоЗначения
&НаСервере
Процедура ДобавитьСохраняемоеПолноеЗначение(Параметр, ХранимоеЗначение=Неопределено)
	
	Если Не CW_МониторинговыеПараметрыСервер.ИспользуетсяСохранениеПолногоЗначения(Параметр) Тогда   
		Возврат
    КонецЕсли;
	
	Соответствие = Новый Соответствие;
	Если ТипЗнч(СохраняемоеПолноеЗначение) = Тип("ФиксированноеСоответствие") Тогда
		Соответствие = Новый Соответствие(СохраняемоеПолноеЗначение);                                             
	КонецЕсли;
	
	Соответствие.Вставить(Параметр, ХранимоеЗначение);
	СохраняемоеПолноеЗначение = Новый ФиксированноеСоответствие(Соответствие);
	
КонецПроцедуры  

&НаСервере
Процедура УдалитьСохраняемоеПолноеЗначение(Параметр)
	
	Если CW_МониторинговыеПараметрыСервер.ИспользуетсяСохранениеПолногоЗначения(Параметр) Тогда
		Соответствие = Новый Соответствие(СохраняемоеПолноеЗначение);
		Соответствие.Удалить(Параметр); 
		СохраняемоеПолноеЗначение = Новый ФиксированноеСоответствие(Соответствие);
	КонецЕсли;
	
КонецПроцедуры
//---ХранениеПолногоЗначения


#Область Подключаемые_внешние_команды

&НаКлиенте
Процедура ВнешняяКоманда_ВыполнитьКоманду(Команда)
	
	CW_ПодключаемыеКомандыКлиент.ВыполнитьВнешнююКоманду(ЭтотОбъект, Команда.Имя);

КонецПроцедуры

#КонецОбласти
